# TessellatedShapeBuilderResult Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TessellatedShapeBuilderResult Members
TessellatedShapeBuilderResult Class Methods Properties See Also
---
The TessellatedShapeBuilderResult type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the TessellatedShapeBuilderResult |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetGeometricalObjects | When called the first time, returns geometrical objects which were built. Later calls will throw exceptions. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetIssuesForFaceSet | Returns the array of issues encountered while processing a face set with index 'setIndex'. |
| GetNumberOfFaceSets | Gets number of face sets for which 'this' result was obtained. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreObjectsAvailable | Shows whether 'issues' still contains the original data or whether these data have already been relinquished by 'getGeometricalObjects'. The former is true, the later is false. |
| HasInvalidData | Whether there were any inconsistencies in the face sets, stored in the tessellated shape builder while building geometrical objects. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Outcome | What kinds of geometrical objects were built. |

# See Also
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace